user-4.0/tutorials/surfaceTracking/interTrackFoam/varCapillarity3DoneFluid/constant/trackedSurfaceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      trackedSurfaceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

twoFluids no;

normalMotionDir no;

motionDir (0 1 0);

cleanInterface yes;

fixedTrackedSurfacePatches 0();

// pointNormalsCorrectionPatches 1( sideWalls );
pointNormalsCorrectionPatches 0();

nTrackedSurfaceCorrectors 1;

useSubMesh          yes;

correctVolume       yes;

// resetControlPoints  yes;

// smoothing           yes;

// freeContactAngle    yes;

// correctPointNormals yes;
// correctDisplacement yes;
// correctCurvature    yes;
//
// fvcNGradUn          yes;

// ************************************************************************* //
